socialNetwork/wrk2/outputs/rps_1.txt
Running 2m test @ http://165.232.188.194:8080/wrk2-api/post/compose
  2 threads and 500 connections
  Thread calibration: mean lat.: 4400.623ms, rate sampling interval: 15671ms
  Thread calibration: mean lat.: 4241.103ms, rate sampling interval: 15712ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    32.48s    17.37s    1.11m    59.53%
    Req/Sec    90.90     57.18   194.00     60.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   29.15s 
 75.000%   46.07s 
 90.000%    0.98m 
 99.000%    1.11m 
 99.900%    1.15m 
 99.990%    1.16m 
 99.999%    1.16m 
100.000%    1.16m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3586.047     0.000000            1         1.00
   11157.503     0.100000         1435         1.11
   14974.975     0.200000         2870         1.25
   20152.319     0.300000         4310         1.43
   24018.943     0.400000         5740         1.67
   29147.135     0.500000         7179         2.00
   31735.807     0.550000         7894         2.22
   35389.439     0.600000         8609         2.50
   40042.495     0.650000         9328         2.86
   43581.439     0.700000        10044         3.33
   46071.807     0.750000        10767         4.00
   47906.815     0.775000        11122         4.44
   50003.967     0.800000        11485         5.00
   53805.055     0.825000        11840         5.71
   56000.511     0.850000        12201         6.67
   57638.911     0.875000        12558         8.00
   58327.039     0.887500        12734         8.89
   59080.703     0.900000        12915        10.00
   59899.903     0.912500        13100        11.43
   60850.175     0.925000        13273        13.33
   61734.911     0.937500        13455        16.00
   62259.199     0.943750        13549        17.78
   62586.879     0.950000        13633        20.00
   63143.935     0.956250        13730        22.86
   63602.687     0.962500        13814        26.67
   64094.207     0.968750        13904        32.00
   64290.815     0.971875        13947        35.56
   64520.191     0.975000        13991        40.00
   64880.639     0.978125        14038        45.71
   65273.855     0.981250        14080        53.33
   65732.607     0.984375        14126        64.00
   65961.983     0.985938        14151        71.11
   66158.591     0.987500        14169        80.00
   66486.271     0.989062        14194        91.43
   66748.415     0.990625        14214       106.67
   67010.559     0.992188        14237       128.00
   67174.399     0.992969        14249       142.22
   67305.471     0.993750        14261       160.00
   67436.543     0.994531        14272       182.86
   67567.615     0.995313        14283       213.33
   67698.687     0.996094        14292       256.00
   67829.759     0.996484        14300       284.44
   68026.367     0.996875        14307       320.00
   68091.903     0.997266        14309       365.71
   68419.583     0.997656        14318       426.67
   68550.655     0.998047        14322       512.00
   68616.191     0.998242        14329       568.89
   68616.191     0.998437        14329       640.00
   68616.191     0.998633        14329       731.43
   68681.727     0.998828        14333       853.33
   68747.263     0.999023        14335      1024.00
   68812.799     0.999121        14336      1137.78
   68878.335     0.999219        14337      1280.00
   68943.871     0.999316        14340      1462.86
   68943.871     0.999414        14340      1706.67
   69009.407     0.999512        14342      2048.00
   69009.407     0.999561        14342      2275.56
   69337.087     0.999609        14344      2560.00
   69337.087     0.999658        14344      2925.71
   69337.087     0.999707        14344      3413.33
   69402.623     0.999756        14348      4096.00
   69402.623     1.000000        14348          inf
#[Mean    =    32484.588, StdDeviation   =    17371.764]
#[Max     =    69337.088, Total count    =        14348]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  17400 requests in 1.68m, 3.57MB read
  Socket errors: connect 0, read 500, write 239, timeout 18438
Requests/sec:    173.04
Transfer/sec:     36.33KB