socialNetwork/wrk2/outputs/rps_1000.txt
Running 2m test @ http://165.232.188.194:31111//wrk2-api/post/compose
  2 threads and 500 connections
  Thread calibration: mean lat.: 2958.603ms, rate sampling interval: 12238ms
  Thread calibration: mean lat.: 3223.595ms, rate sampling interval: 13385ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    22.61s    16.47s    1.08m    64.38%
    Req/Sec    89.08     63.24   187.00     53.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   20.63s 
 75.000%   32.41s 
 90.000%   47.05s 
 99.000%    1.08m 
 99.900%    1.40m 
 99.990%    1.49m 
 99.999%    1.53m 
100.000%    1.53m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      46.271     0.000000            1         1.00
    3377.151     0.100000         1486         1.11
    7139.327     0.200000         2973         1.25
   10936.319     0.300000         4458         1.43
   15319.039     0.400000         5942         1.67
   20627.455     0.500000         7432         2.00
   22233.087     0.550000         8173         2.22
   24330.239     0.600000         8918         2.50
   26525.695     0.650000         9660         2.86
   29065.215     0.700000        10400         3.33
   32407.551     0.750000        11143         4.00
   34209.791     0.775000        11513         4.44
   36143.103     0.800000        11886         5.00
   38993.919     0.825000        12260         5.71
   41484.287     0.850000        12635         6.67
   44007.423     0.875000        12997         8.00
   45580.287     0.887500        13186         8.89
   47054.847     0.900000        13368        10.00
   48627.711     0.912500        13557        11.43
   50561.023     0.925000        13740        13.33
   52658.175     0.937500        13928        16.00
   53837.823     0.943750        14018        17.78
   54951.935     0.950000        14112        20.00
   55869.439     0.956250        14205        22.86
   57180.159     0.962500        14297        26.67
   58785.791     0.968750        14392        32.00
   59506.687     0.971875        14437        35.56
   60358.655     0.975000        14483        40.00
   61112.319     0.978125        14529        45.71
   61898.751     0.981250        14575        53.33
   62849.023     0.984375        14622        64.00
   63275.007     0.985938        14645        71.11
   63799.295     0.987500        14669        80.00
   64520.191     0.989062        14691        91.43
   65077.247     0.990625        14715       106.67
   65830.911     0.992188        14737       128.00
   66453.503     0.992969        14751       142.22
   67043.327     0.993750        14761       160.00
   67567.615     0.994531        14774       182.86
   68550.655     0.995313        14784       213.33
   69074.943     0.996094        14795       256.00
   69664.767     0.996484        14801       284.44
   72089.599     0.996875        14807       320.00
   75759.615     0.997266        14814       365.71
   77004.799     0.997656        14820       426.67
   77987.839     0.998047        14824       512.00
   78315.519     0.998242        14827       568.89
   80150.527     0.998437        14830       640.00
   81854.463     0.998633        14833       731.43
   82837.503     0.998828        14836       853.33
   84213.759     0.999023        14839      1024.00
   84475.903     0.999121        14840      1137.78
   84672.511     0.999219        14842      1280.00
   84803.583     0.999316        14844      1462.86
   85196.799     0.999414        14846      1706.67
   85196.799     0.999512        14846      2048.00
   85524.479     0.999561        14847      2275.56
   86179.839     0.999609        14848      2560.00
   86179.839     0.999658        14848      2925.71
   86245.375     0.999707        14849      3413.33
   86376.447     0.999756        14850      4096.00
   86376.447     0.999780        14850      4551.11
   87949.311     0.999805        14851      5120.00
   87949.311     0.999829        14851      5851.43
   87949.311     0.999854        14851      6826.67
   89587.711     0.999878        14852      8192.00
   89587.711     0.999890        14852      9102.22
   89587.711     0.999902        14852     10240.00
   89587.711     0.999915        14852     11702.86
   89587.711     0.999927        14852     13653.33
   91684.863     0.999939        14853     16384.00
   91684.863     1.000000        14853          inf
#[Mean    =    22611.881, StdDeviation   =    16468.135]
#[Max     =    91619.328, Total count    =        14853]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  17525 requests in 1.67m, 3.59MB read
  Socket errors: connect 0, read 370, write 211, timeout 19919
  Non-2xx or 3xx responses: 1
Requests/sec:    174.70
Transfer/sec:     36.68KB