socialNetwork/wrk2/outputs/rps_50.txt
Running 2m test @ http://165.232.188.194:31111//wrk2-api/post/compose
  2 threads and 500 connections
  Thread calibration: mean lat.: 2923.216ms, rate sampling interval: 12591ms
  Thread calibration: mean lat.: 4053.622ms, rate sampling interval: 15458ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    43.14s    26.41s    1.62m    57.86%
    Req/Sec    61.83     36.96   118.00     50.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   43.68s 
 75.000%    1.03m 
 90.000%    1.33m 
 99.000%    1.62m 
 99.900%    1.64m 
 99.990%    1.65m 
 99.999%    1.65m 
100.000%    1.65m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     147.839     0.000000            1         1.00
   10174.463     0.100000         1114         1.11
   13787.135     0.200000         2225         1.25
   21741.567     0.300000         3339         1.43
   38043.647     0.400000         4453         1.67
   43679.743     0.500000         5566         2.00
   46235.647     0.550000         6120         2.22
   49545.215     0.600000         6679         2.50
   52592.639     0.650000         7232         2.86
   56918.015     0.700000         7789         3.33
   61702.143     0.750000         8346         4.00
   63635.455     0.775000         8622         4.44
   66191.359     0.800000         8906         5.00
   68812.799     0.825000         9179         5.71
   71172.095     0.850000         9462         6.67
   74645.503     0.875000         9739         8.00
   76546.047     0.887500         9876         8.89
   80019.455     0.900000        10014        10.00
   86835.199     0.912500        10152        11.43
   90898.431     0.925000        10292        13.33
   92405.759     0.937500        10435        16.00
   92995.583     0.943750        10502        17.78
   93519.871     0.950000        10572        20.00
   94306.303     0.956250        10643        22.86
   94830.591     0.962500        10711        26.67
   95354.879     0.968750        10782        32.00
   95617.023     0.971875        10819        35.56
   95879.167     0.975000        10854        40.00
   96075.775     0.978125        10889        45.71
   96272.383     0.981250        10927        53.33
   96534.527     0.984375        10960        64.00
   96600.063     0.985938        10970        71.11
   96731.135     0.987500        10986        80.00
   96927.743     0.989062        11011        91.43
   97058.815     0.990625        11023       106.67
   97189.887     0.992188        11039       128.00
   97255.423     0.992969        11047       142.22
   97386.495     0.993750        11059       160.00
   97452.031     0.994531        11067       182.86
   97583.103     0.995313        11075       213.33
   97648.639     0.996094        11082       256.00
   97779.711     0.996484        11091       284.44
   97779.711     0.996875        11091       320.00
   97845.247     0.997266        11095       365.71
   97910.783     0.997656        11099       426.67
   97976.319     0.998047        11104       512.00
   98041.855     0.998242        11107       568.89
   98107.391     0.998437        11114       640.00
   98107.391     0.998633        11114       731.43
   98107.391     0.998828        11114       853.33
   98172.927     0.999023        11118      1024.00
   98172.927     0.999121        11118      1137.78
   98172.927     0.999219        11118      1280.00
   98172.927     0.999316        11118      1462.86
   98238.463     0.999414        11119      1706.67
   98435.071     0.999512        11121      2048.00
   98435.071     0.999561        11121      2275.56
   98435.071     0.999609        11121      2560.00
   98697.215     0.999658        11123      2925.71
   98697.215     0.999707        11123      3413.33
   98697.215     0.999756        11123      4096.00
   98697.215     0.999780        11123      4551.11
   98697.215     0.999805        11123      5120.00
   98762.751     0.999829        11124      5851.43
   98762.751     0.999854        11124      6826.67
   98762.751     0.999878        11124      8192.00
   98762.751     0.999890        11124      9102.22
   98762.751     0.999902        11124     10240.00
   98828.287     0.999915        11125     11702.86
   98828.287     1.000000        11125          inf
#[Mean    =    43138.885, StdDeviation   =    26408.163]
#[Max     =    98762.752, Total count    =        11125]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14256 requests in 1.67m, 2.98MB read
  Socket errors: connect 0, read 284, write 44, timeout 18005
  Non-2xx or 3xx responses: 516
Requests/sec:    142.25
Transfer/sec:     30.41KB